Func number	ATLAS name	Query SPARQL	API name	REST method	Query SPARQL example	example result json
1	getClass	SELECT DISTINCT (GROUP_CONCAT(DISTINCT ?class; SEPARATOR=";  ") AS ?classes)  WHERE {<"""+res_uri+"""> a ?class}	endpoint/class/?uri=	get	SELECT DISTINCT (GROUP_CONCAT(DISTINCT ?class; SEPARATOR=";  ") AS ?classes)  WHERE {<https://w3id.org/dh-atlas/1728943937-3007112> a ?class}	{"head":{"vars":["classes"]},"results":{"bindings":[{"classes":{"type":"literal","value":"https://schema.org/Dataset;  https://w3id.org/dh-atlas/LinkedOpenData"}}]}}
2	getLabel	PREFIX skos: <http://www.w3.org/2004/02/skos/core#>         SELECT DISTINCT ?label WHERE {                 <"""+uri+"""> (rdfs:label | skos:prefLabel) ?label         }  	endpoint/label/?uri=	get	PREFIX skos: <http://www.w3.org/2004/02/skos/core#>         SELECT DISTINCT ?label WHERE {                 <https://w3id.org/dh-atlas/1728943937-3007112> (rdfs:label | skos:prefLabel) ?label         } 	{"head":{"vars":["label"]},"results":{"bindings":[{"label":{"xml:lang":"en","type":"literal","value":"Zeri Photo Archive RDF Dataset"}}]}}
3	counter_Entities	PREFIX dbpedia: <http://dbpedia.org/ontology> SELECT (COUNT(DISTINCT ?entity) as ?count) WHERE { ?entity a ?class . }	endpoint/stats/entities/count	get		{"head":{"vars":["count"]},"results":{"bindings":[{"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"241"}}]}}
4	counter_Research_Projects	PREFIX dbpedia: <http://dbpedia.org/ontology> SELECT (COUNT(DISTINCT ?project) as ?count) WHERE { ?project a <http://xmlns.com/foaf/0.1/Agent>; a <https://schema.org/ResearchProject> . }	endpoint/stats/project/count	get		{"head":{"vars":["count"]},"results":{"bindings":[{"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"14"}}]}}
5	counter_Research_Products	PREFIX dbpedia: <http://dbpedia.org/ontology> SELECT (COUNT(DISTINCT ?product) as ?count) WHERE { ?product a <https://schema.org/Dataset> . }	endpoint/stats/product/count	get		{"head":{"vars":["count"]},"results":{"bindings":[{"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"37"}}]}}
6	counter_Organizations	PREFIX dbpedia: <http://dbpedia.org/ontology> SELECT (COUNT(DISTINCT ?organization) as ?count) WHERE { ?organization a <http://xmlns.com/foaf/0.1/Agent>; a <https://schema.org/Organization> . }	endpoint/stats/organization/count	get		{"head":{"vars":["count"]},"results":{"bindings":[{"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"72"}}]}}
7	counter_Researchers	PREFIX dbpedia: <http://dbpedia.org/ontology> SELECT (COUNT(DISTINCT ?person) as ?count) WHERE { ?person a <http://xmlns.com/foaf/0.1/Agent>; a <https://schema.org/Person> . }	endpoint/stats/person/count	get		{"head":{"vars":["count"]},"results":{"bindings":[{"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"98"}}]}}
8	getResearchProductsByType	PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>  SELECT ?label (COUNT(?item) AS ?count) WHERE { GRAPH ?g { ?item a <https://schema.org/Dataset> . ?item <http://schema.org/additionalType> ?additionalType . ?additionalType rdfs:label ?label .  } } GROUP BY ?label ORDER BY DESC(?count)	endpoint/stats/product/by-type	get		{"head":{"vars":["label","count"]},"results":{"bindings":[{"label":{"datatype":"http://www.w3.org/2001/XMLSchema#string","type":"literal","value":"Digital Scholarly Edition"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"18"}},{"label":{"datatype":"http://www.w3.org/2001/XMLSchema#string","type":"literal","value":"Linked Open Data"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"6"}},{"label":{"datatype":"http://www.w3.org/2001/XMLSchema#string","type":"literal","value":"Software"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"5"}},{"label":{"datatype":"http://www.w3.org/2001/XMLSchema#string","type":"literal","value":"Ontology"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"4"}},{"label":{"datatype":"http://www.w3.org/2001/XMLSchema#string","type":"literal","value":"Text Collection"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"4"}}]}}
9	getOrganizations	PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>  SELECT ?label (COUNT(DISTINCT ?researchProduct) AS ?count) WHERE {  ?researchProduct a <https://schema.org/Dataset> .  ?researchProduct ?contributor ?organization .   GRAPH ?g { ?organization a <https://schema.org/Organization> . ?organization rdfs:label ?organizationLabel . BIND(STR(?organizationLabel) AS ?label) } } GROUP BY ?label ORDER BY DESC(?count) LIMIT 6	endpoint/stats/organization/top	get		{"head":{"vars":["label","count"]},"results":{"bindings":[{"label":{"type":"literal","value":"/DH.ARC - Digital Humanities Advanced Research Centre "},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"5"}},{"label":{"type":"literal","value":"Ca' Foscari University of Venice"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"3"}},{"label":{"type":"literal","value":"University of Basilicata"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"2"}},{"label":{"type":"literal","value":"University of Pisa"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"2"}},{"label":{"type":"literal","value":"Laboratorio di Cultura Digitale (Università di Pisa)"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"2"}},{"label":{"type":"literal","value":"University of Bologna"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"2"}}]}}
10	getLocations	PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>  SELECT ?geonames ?label (COUNT(DISTINCT ?geonames) AS ?count) WHERE { ?organization a <https://schema.org/Organization> . ?organization <http://schema.org/location> ?geonames . ?geonames rdfs:label ?label . } GROUP BY ?geonames ?label ORDER BY ?geonames	endpoint/stats/ocation	get		{"head":{"vars":["geonames","label","count"]},"results":{"bindings":[{"geonames":{"type":"uri","value":"https://sws.geonames.org/2523623"},"label":{"type":"literal","value":"Rende"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/2523920"},"label":{"type":"literal","value":"Palermo"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/2800866"},"label":{"type":"literal","value":"Brussels"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/2968705"},"label":{"type":"literal","value":"Villejuif"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/3164527"},"label":{"type":"literal","value":"Verona"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/3164565"},"label":{"type":"literal","value":"Vercelli"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/3164603"},"label":{"type":"literal","value":"Venice"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/3165243"},"label":{"type":"literal","value":"Trento"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/3165524"},"label":{"type":"literal","value":"Turin"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/3166548"},"label":{"type":"literal","value":"Siena"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/3169070"},"label":{"type":"literal","value":"Rome"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/3169522"},"label":{"type":"literal","value":"Reggio Emilia"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/3170027"},"label":{"type":"literal","value":"Potenza"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/3170647"},"label":{"type":"literal","value":"Pisa"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/3171168"},"label":{"type":"literal","value":"Pescara"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/3171180"},"label":{"type":"literal","value":"Perugia"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/3171457"},"label":{"type":"literal","value":"Parma"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/3172394"},"label":{"type":"literal","value":"Naples"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/3173331"},"label":{"type":"literal","value":"Modena"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/3173435"},"label":{"type":"literal","value":"Milan"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/3176219"},"label":{"type":"literal","value":"Genoa"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/3176959"},"label":{"type":"literal","value":"Florence"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/3176959"},"label":{"datatype":"http://www.w3.org/2001/XMLSchema#string","type":"literal","value":"Florence"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/3178796"},"label":{"type":"literal","value":"Chieti"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/3181928"},"label":{"type":"literal","value":"Bologna"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/3182351"},"label":{"type":"literal","value":"Bari"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/3182884"},"label":{"type":"literal","value":"Arezzo"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/5883102"},"label":{"type":"literal","value":"Alberta"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/5967629"},"label":{"type":"literal","value":"Guelph"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/6077243"},"label":{"type":"literal","value":"Montreal"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}},{"geonames":{"type":"uri","value":"https://sws.geonames.org/6141256"},"label":{"datatype":"http://www.w3.org/2001/XMLSchema#string","type":"literal","value":"Saskatoon"},"count":{"datatype":"http://www.w3.org/2001/XMLSchema#integer","type":"literal","value":"1"}}]}}